{
  "Article1": {
    "heading": "University-Enterprise Collaboration to Build Artificial Intelligence Innovation Institute",
    "p1": "Huazhong University of Science and Technology and Wuhan Shannon Technology Co.,Ltd. recently signed a cooperation agreement to build Artificial Intelligence Innovation Institute (AIII), which will combine the advantages of R&D, industry, talents and innovation resources to expand the application of artificial intelligence technology in industrial manufacturing, digital content, distributed storage, firefighting, medical, pan-entertainment and other fields. The two companies will combine their strengths in R&D, industry, talents and innovation resources to expand the application of AI technology in industrial manufacturing, digital content, distributed storage, firefighting, medical care, and pan-entertainment.",
    "p2": "The Wuhan Artificial Intelligence Innovation Center of Shannon is an industry-academia-research complex based on the School of HUST, which is mainly engaged in technology research and development, system development, intelligent upgrading and test verification in AI-related fields, promoting the transformation of innovative achievements and industrial incubation, attracting and training first-class scientific research talents, promoting scientific and technological synergy and industrial integration. innovation and industrial integration development, and is committed to becoming a high-level new research institution",
    "p3": "It is reported that, relying on Wuhan's AI industry support policy and the location advantage of high-end industry gathering, the two sides will jointly build a new highland of Wuhan AI industry, and help promote the transformation of scientific and technological achievements and high-level talent training.",
    "p4": "At present, the Innovation Center has gathered a large number of elites and scholars in the field of artificial intelligence, with a core team of 10 scientists, all of whom have PhDs and long-term visiting research experience in well-known foreign AI laboratories. The Center has also invited a number of foreign scientists, including two Nobel Prize winners and one IEEE Fellow, as advisors. There is also a large team of Ph.D. and M.S. students involved in scientific research and technology development.",
    "p5": "The establishment of the AI Innovation Center will accelerate the gathering of talents in Wuhan's new science and technology industries, promote regional digital development and industrial upgrading, enhance the comprehensive strength of Wuhan's science and technology self-research and innovation, and promote the evolution of Wuhan's research in artificial intelligence to a more cutting-edge stage."
  },
  "Article3": {
    "heading": "Novel tagging intelligent labeling system",
    "p1": "According to the 48th \"China Internet Development Statistics Report\" released by China Internet Network Information Center, as of September 2020, the scale of China's online literature users reached 467 million, and the scale of cell phone online literature users reached 465 million. Although affected by the slow demographic dividend of the domestic Internet, the growth rate of online literature users has slowed down compared with the average value of the previous years, but from the data performance of the industry user scale still shows a stable growth of healthy development. The huge scale of users provides a traffic base for the development of online literature, and the strong support and investment of major online literature platforms have led to a spurt of growth in the number of online literature works in recent years. As mentioned in the \"China Internet Literature Copyright Protection Research Report\" released by Ari Consulting in June 2020, the ReadWrite Group has as many as 8.1 million writers in residence as of 2019, with the total number of platform works reaching 12.2 million and 11.5 million of its own original literary works, and new works are constantly emerging.",
    "p2": "The large base and rapid updates of online literature works have brought some troubles and challenges for both authors and readers. For authors of online literature, mastering the current flow direction and the types of works readers are interested in can better guide the direction of writing and increase the number of clicks on their works. For readers, how to choose the works they are interested in is a problem that needs to be solved. Many readers often can only choose from the popular works on the platform, which makes it more and more difficult for some new and excellent works to get clicks, which is not conducive to the long-term development of the whole industry. At the same time, online literary works usually have many words and mixed characters, so it is difficult for readers to sort out the article and the relationship between characters, and they often read and forget, which leads to the limited dissemination of works. In order to provide authors with writing guidance and facilitate readers' selection, work classification is a common solution. By classifying works based on several different dimensions, it facilitates later analysis and visual display, and brings convenience for authors and readers to understand the works. In addition, extracting story highlights from works through text summaries can help readers understand the general plot of a story in advance. In addition to the simple classification of works, in order to help readers sort out the story line and the relationship between characters, all characters appearing in the author can be extracted for character portraits from multiple dimensions and character descriptions and characteristics. In addition, visual display through character relationship mapping is more helpful to understand the intricate relationships among many characters.",
    "p3": "The traditional text analysis method is based on features, i.e., extracting relevant features such as word frequency, lexicality, TF-IDF, etc., and then using Support Vector Machine (SVM) or Gradient Boosted Decision Tree (GBDT), GBDT) machine learning methods for classification. Since 2012, with the rapid development of deep learning technology and GPU performance, natural language processing technology based on deep learning has gradually replaced the traditional manual feature plus machine learning methods. Deep learning-based methods usually do not require artificial features, but map each word into a dense embedding representation, and then go through a designed multilayer neural network, calculate the loss function and update the parameters of the neural network and the embedding representation by the back-propagation algorithm.",
    "header-main-1": "Algorithms Introduction",
    "header-sub-1": "Word2Vec model",
    "p4": "Word2Vec is a method for efficiently obtaining word representations in vector space. word2Vec is based on the intuitive assumption that the semantics of two different words with similar contexts are close. The core idea is to consider that the semantics of a word is influenced by its contextual environment, so the association between the context and the word can be constructed by a neural network with a single hidden layer, so that the parameters of the hidden layer can be used as the representations of the corresponding index words by training such a neural network with a large unlabeled corpus. Word2Vec proposes two training methods for the network, namely CBOW and Skip-Gram, and their model structures are shown in Figure 3-1.",
    "p5": "The core idea of the CBOW model is to predict the word using the peripheral words of the central word by defining a sliding window of fixed length to obtain the central word and the peripheral words, where the peripheral words contain both the above word and the below word. The peripheral word is used as the output of the input layer, the average of the peripheral word embedding vector is used as the output of the hidden layer, and finally the score and cross-entropy loss of the output layer are calculated for back propagation.",
    "p6": "<p>As shown in Equation (3-1), denotes the number of words in context, C denotes the number of words corresponding to words in context, <strong><i>X<sub>1</sub>,...,X<sub>C</sub></i></strong>&nbsp;&nbsp;denotes the unique thermal code corresponding to the word in the context, then <strong><i>V<sub>w1</sub></i></strong> denotes the embedding vector of the word <strong><i>W<sub>1</sub></i></strong>, and the objective function is defined as Equation (3-2).The meaning of this objective function is based on the given context words <strong><i>W<sub>1</sub>,...,W<sub>C</sub></i></strong> Maximize the probability that the output is <strong><i>W<sub>0</sub></i></strong> of the central word: </p>",
    "p7": "<p>The idea of Skip-Gram model is exactly the opposite of CBOW, where the central word is represented as input as <strong><i>W<sub>1</sub></i></strong>, and the context words <strong><i>W<sub>1</sub>,...,W<sub>C</sub></i></strong> as the target output of the prediction. In this case, the objective function is shown in Equation (3-3).</p>",
    "p8": "Both the CBOW model and the Skip-Gram model are based on a large unlabeled corpus and are trained using a backpropagation algorithm. The back-propagation is used to continuously update the hidden layer parameters to ensure that the corresponding representational vectors of words are biased towards their most commonly used semantics.",
    "header-main-2": "Distance vector",
    "p9": "<p>Euclidean distance is the distance between two points in Euclidean space. Euclidean distance is the basic metric distance, which is often used to measure the distance between two vectors. For two vectors <strong><i>X = (x<sub>1</sub>,x<sub>2</sub>,...x<sub>n</sub>)</i></strong> and <strong><i>Y = (y<sub>1</sub>,y<sub>2</sub>,...y<sub>n</sub>)</i></strong>, In this system that corresponds to two text embedded vectors, their Euclidean distance is shown in equation (3-4)</p>",
    "p10": "The cosine distance measures the distance between two vectors by measuring the cosine of their angles, which is also called the cosine similarity and is often used for measuring text similarity. For two text-embedded vectors, their cosine distances are given in equation (3-5).",
    "header-main-3": "Text classifier",
    "p11": "The RNN model structure is shown in Figure 3-2.",
    "caption": "Figure 3-2 RNN model structure diagram",
    "p12": "<p>According to Figure 3-2 above, The word embedding of the text sequence is represented as <strong><i>x<sub>0</sub>,x<sub>1</sub>,x<sub>2</sub>,...,x<sub>t</sub></i></strong>，input <strong><i>t</i></strong> at the time <strong><i>x<sub>t</sub></i></strong> and the output state <strong><i>h<sub>t-1</sub></i></strong> at the previous moment to obtain the output at time <strong><i>t</i></strong> , as shown in equation (3-6):</p>",
    "p13": "<p>Where <strong><i>h<sub>t-1</sub></i></strong>is the hidden layer output at the current moment and the function <strong><i>g</i></strong> is the activation function, <strong><i>W<sub>h</sub></i></strong> is the weight that converts the output of the previous moment to the output of the current moment, <strong><i>W<sub>h</sub></i></strong>  is the weight that converts the input <strong><i>x</i></strong> to the output <strong><i>h</i></strong> , and <strong><i>b</i></strong> is the bias.</p>",
    "p14": "As shown in Figure 3-2, the RNN layer at each moment receives the input of that layer and the output of the previous RNN layer, and then calculates the output of the current moment accordingly. Thus, the RNN is a \"layer with memory\" that captures the sequence information of the text."
  },
  "Article4": {
    "heading-1": "Island King game package recommendation system",
    "p1": "With the popularity of electronic computers and mobile devices, games have entered the daily life of more and more people. A well-designed game can not only let people enjoy the satisfaction and happiness brought by the virtual world, but also bring huge revenue to game developers. The commercialization of online games mainly depends on value-added services, such as the sale of virtual props. In this case, personalized recommendation system slowly becomes an indispensable part of game operation. On the one hand, players may need better guidance during the game, and timely recommendation of props for players can improve the user experience; on the other hand, operators can also enjoy the revenue brought by the sale of props, thus forming a virtuous circle.",
    "p2": "Traditional personalized recommendation methods mainly include collaborative filtering and content-based recommendation. Among them, collaborative filtering methods mainly recommend users based on their browsing and purchasing behaviors, and common CF methods include nearest neighbor-based methods, matrix decomposition methods, SVD++ and FM, etc.; while content-based recommendation methods model the portraits of users and goods for better recommendations. However, such existing methods are often difficult to achieve good results for virtual goods, especially for virtual goods such as props in games.",
    "p3": "Game props have complex contextual relevance. Users' interest in game props is not only influenced by other similar players, but also by the game context, i.e., the plot and difficulty, and even the latter is more influential. Such context is extremely complex, it may be a scene in the game, other similar players or a player's own action, all may trigger the user's temporary purchase demand for certain props, then quickly and infrequently give recommendations, on the one hand, can help users overcome difficulties and smooth game experience, on the other hand, can also bring revenue conversion at the same time.",
    "header-main-1": "Main tasks",
    "p4": "We need to recommend gift packs to users that contain the pack's energy value, gold count, brick count, pet food count, and pack amount, as well as the pack's next refresh time. The main task of the recommendation algorithm is to select the packs that players are most likely to buy from the available packs, in order to maximize the average revenue generated by the recommendations for each user.",
    "header-main-2": "Algorithms Introduction",
    "header-sub-1": "cfwV1",
    "p5": "cfwV1 is the first version of the collaborative filtering algorithm developed, which has four main steps, namely user stratification, calculation of item similarity, calculation of the final score after adding time decay, and recommendation strategy.",
    "header-sub-2": "·User Layers:",
    "p6": "The users are classified according to 'pay_amt' (user characteristics: the total amount paid by the user), and the users are divided into three layers: large, medium and small, and the item similarity is calculated separately for each layer.",
    "header-sub-3": "· Item similarity calculation:",
    "p7": "Different item similarity matrices are calculated separately for different levels of user data, and the calculation formula is shown below:",
    "p8": "Where N(i) denotes the set of users who have purchased gift package i and |N(i)| denotes the number of users in the set N(i).",
    "header-sub-4": "Calculate the final score of user u for gift package i",
    "p9": "① If the user has a previous record of purchasing gift packs, the item similarity matrix is used to calculate the user's score for each gift pack, calculated as follows:",
    "p10": "where N(u) denotes the set of gift packs purchased by user u, t denotes the current time, tj denotes the time when user purchased gift pack j (in the cfwV1 model, if the interval between tj and t is 7 days, then t-tj=1), and wji denotes the similarity between gift pack j and gift pack i.",
    "p11": "② If the user has no previous record of buying a gift package, the cold-start scoring scheme is used: user u's score for gift package i is the number of gift packages purchased for the first time by all users in user u's tier for gift package i.",
    "header-sub-5": "· Recommended Strategies:",
    "p12": "With user u's score for gift package i, it is still necessary to determine how to use these scores to get the final recommendation. cfwV1 model uses expectation sampling recommendation, i.e., the probability of recommending gift package i to user u is",
    "header-main-3": "RFM",
    "p13": "RFM model is an important tool and instrument to measure customer value and customer's ability to create benefits. Among the many analytical models of customer relationship management (CRM), the RFM model is widely mentioned. This mechanical model describes the value profile of a customer through three indicators: the recent purchase behavior of that customer, the overall frequency of the purchase, and how much money was spent. In the current application, R (Recent) indicates the number of days since the user last purchased a gift bag, F (Frequency) indicates the number of times the user purchased a gift bag in the previous 7 days, and M (Monetary) indicates the amount of money the user purchased a gift bag in the previous 7 days.RFM model is based on these three user characteristics to stratify the user, of different levels of the user to recommend different gift bags.",
    "header-main-4": "cfwV2 and two recommended strategies",
    "p14": "cfwV2 only changed the formula for calculating the most total score and the recommendation strategy. cfwV2 model only recorded users' purchase data in the last two months, while cfwV1 model recorded all users' previous purchase data; the unit of time interval was modified in cfwV2 model (when the interval between t and tj is 2 days, t-tj=1). Price Sample (PS): the same recommendation strategy as in cfwV1, i.e., the price of the gift package is considered before sampling. User inducement(UI): Based on the completion of PS sampling, the recommended gift package to the user has a 25% probability to become the next level of gift package.",
    "p18": "Sample(PS): The same recommendation strategy as in cfwV1, i.e. sampling after considering the price of the gift pack.",
    "p19": "User inducement (UI): On the basis of the completion of PS sampling, there is a 25% probability that the gift package recommended to the user will become the next level of gift package.",
    "heading-2": "Island King test protocols and metrics",
    "p15": "An A/B testing scheme was used for different models, essentially dividing the platform's traffic evenly into groups, using different recommendation models/algorithms on each group, and then comparing the models/algorithms based on the user data metrics of these groups.",
    "p16": "The first test mainly tested each metric of cfwV1 (the first version of collaborative filtering model) and RFM model; the second test mainly tested each metric of the same model cfwV2 under different recommendation strategies (with user inducement (UI), without user inducement (price sample, PS)).",
    "p17": "The model successfully induced the user to purchase a gift package that was originally higher than he should have purchased. To sum up, the strategy of using user elicitation may be resisted by the user at the beginning, but then it will subconsciously change the user's purchasing behavior and achieve the goal of the test."
  }
}
