{
  "Index": {
    "title": "Home Page",
    "gallery-button": "Deep reinforcement learning"
  },
  "Apply": {
    "title": "HUST AI II Introduction",
    "content": "Huake Artificial Intelligence Innovation Center is an artificial intelligence based on Huazhong University of Science and Technology and its international friend schools.Artificial intelligence jointly established by high-level scholars in basic research and application scenario research in the research field Advanced Institute.",
    "button": "APPLY"
  },
  "Domain": {
    "title": "HUST AI II",
    "subtitle": "Current research directions and fields",
    "description": "Combining the advantages of R&D, industry, talents, innovation resources, etc., we will expand artificial intelligence technology in the following industries",
    "tag1": "city fire",
    "tag2": "health care",
    "tag3": "Distributed storage",
    "tag4": "industrial manufacturing",
    "tag5": "digital content",
    "tag6": "Pan entertainment"
  },
  "News": {
    "title": "NEWS",
    "subtitle1": "Fire emergency rescue",
    "subtitle2": "Data Analysis Application",
    "content1": "High adaptive sensing equipment and disaster source location technology for urban fire, explosion and integrated pipe gallery accidents",
    "content2": "Study on imaging method of multi-component gas concentration field based on acoustic velocity dispersion",
    "content3": "Research on intelligent fault diagnosis and leak monitoring of natural gas station based on audio signal",
    "content4": "Research on defect detection technology and diagnosis method of high voltage Shunt Reactor based on acoustic vibration signal",
    "content5": "Research on GIS equipment handover acceptance and mechanical status detection and diagnosis technology during operation",
    "button": "learn more"
  },
  "Scholars": {
    "title": "HUST AI II Researcher",
    "subtitle": "At present, the innovation center has gathered a large number of elites and scholars in the field of artificial intelligence, and has 10 core scientists",
    "scholar1": {
      "name": "Ming Zhu",
      "title": "Professor, Director",
      "honors": "<p>Professor/Ph.D. supervisor at HUST, Deputy Director of National Engineering Laboratory</p><p>Get a PhD degree in Communication Engineering of HUST in 2008</p><p>2014 Visiting Scholar, Northwestern University, USA, under the supervision of Prof. Richard M. Lueptow</p><p>Published 12 papers in top international conferences and journals</p>"
    },
    "scholar2": {
      "name": "Quan Yuan",
      "title": "Senior Researcher",
      "honors": "<p>15 years of research in data analysis and artificial intelligence</p><p>Under the supervision of Prof. Eyad Abed, IEEE Fellow</p><p>Published 13 SCI papers in top international journals and hosted more than 10 scientific grants in China and abroad.</p><p>In 2010, Received his PhD degree from HUST and the University of Maryland, USA.</p>"
    },
    "scholar3": {
      "name": "Qing Tang",
      "title": "Senior Researcher",
      "honors": "<p>Ph.d of Santiago de Compostela</p><p>Visiting Scholar, La Sapienza, University of Rome</p><p>Visiting Scholar, Singapore Management University</p><p>Research areas: game theory, operations research and financial modeling</p>"
    },
    "scholar4": {
      "name": "Zhuo Chen",
      "title": "Professor",
      "honors": "<p>2010 PhD in Communication Engineering from HUST</p><p>Visiting scholar at Florida State University, USA</p><p>charge of research and development of artificial intelligence and machine learning, and has been awarded more than 8 million RMB by the National Natural Science Foundation of China</p>"
    },
    "scholar5": {
      "name": "Peng Guo",
      "title": "Professor",
      "honors": "<p>Professor at HUST, postdoctoral research at HKUST and HKPU</p><p>In 2011, selected as one of the first batch of National Heung Kong Scholars</p><p>First Prize of the First National Industry 4.0 Smart Manufacturing Innovation and Entrepreneurship Competition in 2016</p>"
    },
    "scholar6": {
      "name": "WenBo Xu",
      "title": "Senior Researcher",
      "honors": "<p>Postdoctoral Fellow in Information and Signal Processing of HUST</p><p>Research Interests: Communication technology, information and signal processing, deep learning, low-speed sampling techniques based on compressed sensing of large dynamic signals</p>"
    },
    "scholar7": {
      "name": "JianWen Chen",
      "title": "Senior Researcher",
      "honors": "<p>Professor, School of Electronic Information and Communication of HUST</p><p>Research interests are multimodal machine learning and knowledge graph theory</p>"
    },
    "scholar8": {
      "name": "Wei Liu",
      "title": "Professor",
      "honors": "<p>Professor of School of Electronic Information and Communication, HUST, Member of IEEE Communications Section, Member of Chinese Institute of Electronics, Member of Chinese Society of Communication, Member of Chinese Computer Society</p><p>Leading the National Natural Science Foundation of China (NSFC) project \"Research on Key Technologies of Mobile Content Center Network\"</p>"
    },
    "scholar9": {
      "name": "Shu Yan",
      "title": "Senior Researcher",
      "honors": "<p>PhD in Communication Engineering, HUST</p><p>Open Access Scholar, University of Sheffield, UK</p><p>Specialized in compressed sensing, intelligent signal processing, machine learning, embedded and DSP systems, etc.</p>"
    },
    "scholar10": {
      "name": "Eyad Abed",
      "title": "Innovation Center Consultant",
      "honors": "Professor, Ph.D., University of Maryland, USA; Fellow of the IEEE</p><p>Senior Director, American Natural Science Foundation</p>"
    },
    "scholar12": {
      "name": "Sheldon Lee Glashow",
      "title": "Innovation Center Consultant",
      "honors": "<p>World-renowned theoretical physicist, one of the founders of the standard model of particle physics</p><p>Member of the American Academy of Sciences</p><p>1979 Nobel Laureate in Physics</p><p>1976 Oppenheimer Prize</p>"
    }
  }
}
